TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_memss.h
//###########################################################################
//
// FILE:    hw_memss.h
//
// TITLE:   Definitions for the MEMSS registers.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef HW_MEMSS_H
#define HW_MEMSS_H

//*************************************************************************************************
//
// The following are defines for the MEMSS register offsets
//
//*************************************************************************************************
#define MEMSS_O_LPA0_MEM_CONFIG          0x0U    // LPA0 Memory Configuration Register
#define MEMSS_O_LPA0_MEM_CONFIG_LOCK     0x4U    // Temporary Lock for LPA0 Memory Configuration
                                                 // Register
#define MEMSS_O_LPA0_MEM_CONFIG_COMMIT   0x8U    // Permament Lock for LPA0 Memory Configuration
                                                 // Register
#define MEMSS_O_LPA1_MEM_CONFIG          0x10U   // LPA1 Memory Configuration Register
#define MEMSS_O_LPA1_MEM_CONFIG_LOCK     0x14U   // Temporary Lock for LPA1 Memory Configuration
                                                 // Register
#define MEMSS_O_LPA1_MEM_CONFIG_COMMIT   0x18U   // Permament Lock for LPA1 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA0_MEM_CONFIG          0x20U   // LDA0 Memory Configuration Register
#define MEMSS_O_LDA0_MEM_CONFIG_LOCK     0x24U   // Temporary Lock for LDA0 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA0_MEM_CONFIG_COMMIT   0x28U   // Permament Lock for LDA0 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA1_MEM_CONFIG          0x30U   // LDA1 Memory Configuration Register
#define MEMSS_O_LDA1_MEM_CONFIG_LOCK     0x34U   // Temporary Lock for LDA1 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA1_MEM_CONFIG_COMMIT   0x38U   // Permament Lock for LDA1 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA2_MEM_CONFIG          0x40U   // LDA2 Memory Configuration Register
#define MEMSS_O_LDA2_MEM_CONFIG_LOCK     0x44U   // Temporary Lock for LDA2 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA2_MEM_CONFIG_COMMIT   0x48U   // Permament Lock for LDA2 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA3_MEM_CONFIG          0x50U   // LDA3 Memory Configuration Register
#define MEMSS_O_LDA3_MEM_CONFIG_LOCK     0x54U   // Temporary Lock for LDA3 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA3_MEM_CONFIG_COMMIT   0x58U   // Permament Lock for LDA3 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA4_MEM_CONFIG          0x60U   // LDA4 Memory Configuration Register
#define MEMSS_O_LDA4_MEM_CONFIG_LOCK     0x64U   // Temporary Lock for LDA4 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA4_MEM_CONFIG_COMMIT   0x68U   // Permament Lock for LDA4 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA5_MEM_CONFIG          0x70U   // LDA5 Memory Configuration Register
#define MEMSS_O_LDA5_MEM_CONFIG_LOCK     0x74U   // Temporary Lock for LDA5 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA5_MEM_CONFIG_COMMIT   0x78U   // Permament Lock for LDA5 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA6_MEM_CONFIG          0x80U   // LDA6 Memory Configuration Register
#define MEMSS_O_LDA6_MEM_CONFIG_LOCK     0x84U   // Temporary Lock for LDA6 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA6_MEM_CONFIG_COMMIT   0x88U   // Permament Lock for LDA6 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA7_MEM_CONFIG          0x90U   // LDA7 Memory Configuration Register
#define MEMSS_O_LDA7_MEM_CONFIG_LOCK     0x94U   // Temporary Lock for LDA7 Memory Configuration
                                                 // Register
#define MEMSS_O_LDA7_MEM_CONFIG_COMMIT   0x98U   // Permament Lock for LDA7 Memory Configuration
                                                 // Register

#define MEMSS_O_CPA0_MEM_CONFIG           0x0U    // CPA0 Memory Configuration Register
#define MEMSS_O_CPA0_MEM_CONFIG_LOCK      0x4U    // Temporary Lock for CPA0 Memory Configuration
                                                  // Register
#define MEMSS_O_CPA0_MEM_CONFIG_COMMIT    0x8U    // Permament Lock for CPA0 Memory Configuration
                                                  // Register
#define MEMSS_O_CPA1_MEM_CONFIG           0x10U   // CPA1 Memory Configuration Register
#define MEMSS_O_CPA1_MEM_CONFIG_LOCK      0x14U   // Temporary Lock for CPA1 Memory Configuration
                                                  // Register
#define MEMSS_O_CPA1_MEM_CONFIG_COMMIT    0x18U   // Permament Lock for CPA1 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA0_MEM_CONFIG           0x20U   // CDA0 Memory Configuration Register
#define MEMSS_O_CDA0_MEM_CONFIG_LOCK      0x24U   // Temporary Lock for CDA0 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA0_MEM_CONFIG_COMMIT    0x28U   // Permament Lock for CDA0 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA1_MEM_CONFIG           0x30U   // CDA1 Memory Configuration Register
#define MEMSS_O_CDA1_MEM_CONFIG_LOCK      0x34U   // Temporary Lock for CDA1 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA1_MEM_CONFIG_COMMIT    0x38U   // Permament Lock for CDA1 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA2_MEM_CONFIG           0x40U   // CDA2 Memory Configuration Register
#define MEMSS_O_CDA2_MEM_CONFIG_LOCK      0x44U   // Temporary Lock for CDA2 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA2_MEM_CONFIG_COMMIT    0x48U   // Permament Lock for CDA2 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA3_MEM_CONFIG           0x50U   // CDA3 Memory Configuration Register
#define MEMSS_O_CDA3_MEM_CONFIG_LOCK      0x54U   // Temporary Lock for CDA3 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA3_MEM_CONFIG_COMMIT    0x58U   // Permament Lock for CDA3 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA4_MEM_CONFIG           0x60U   // CDA4 Memory Configuration Register
#define MEMSS_O_CDA4_MEM_CONFIG_LOCK      0x64U   // Temporary Lock for CDA4 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA4_MEM_CONFIG_COMMIT    0x68U   // Permament Lock for CDA4 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA5_MEM_CONFIG           0x70U   // CDA5 Memory Configuration Register
#define MEMSS_O_CDA5_MEM_CONFIG_LOCK      0x74U   // Temporary Lock for CDA5 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA5_MEM_CONFIG_COMMIT    0x78U   // Permament Lock for CDA5 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA6_MEM_CONFIG           0x80U   // CDA6 Memory Configuration Register
#define MEMSS_O_CDA6_MEM_CONFIG_LOCK      0x84U   // Temporary Lock for CDA6 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA6_MEM_CONFIG_COMMIT    0x88U   // Permament Lock for CDA6 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA7_MEM_CONFIG           0x90U   // CDA7 Memory Configuration Register
#define MEMSS_O_CDA7_MEM_CONFIG_LOCK      0x94U   // Temporary Lock for CDA7 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA7_MEM_CONFIG_COMMIT    0x98U   // Permament Lock for CDA7 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA8_MEM_CONFIG           0xA0U   // CDA8 Memory Configuration Register
#define MEMSS_O_CDA8_MEM_CONFIG_LOCK      0xA4U   // Temporary Lock for CDA8 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA8_MEM_CONFIG_COMMIT    0xA8U   // Permament Lock for CDA8 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA9_MEM_CONFIG           0xB0U   // CDA9 Memory Configuration Register
#define MEMSS_O_CDA9_MEM_CONFIG_LOCK      0xB4U   // Temporary Lock for CDA9 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA9_MEM_CONFIG_COMMIT    0xB8U   // Permament Lock for CDA9 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA10_MEM_CONFIG          0xC0U   // CDA10 Memory Configuration Register
#define MEMSS_O_CDA10_MEM_CONFIG_LOCK     0xC4U   // Temporary Lock for CDA10 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA10_MEM_CONFIG_COMMIT   0xC8U   // Permament Lock for CDA10 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA11_MEM_CONFIG          0xD0U   // CDA11 Memory Configuration Register
#define MEMSS_O_CDA11_MEM_CONFIG_LOCK     0xD4U   // Temporary Lock for CDA11 Memory Configuration
                                                  // Register
#define MEMSS_O_CDA11_MEM_CONFIG_COMMIT   0xD8U   // Permament Lock for CDA11 Memory Configuration
                                                  // Register

#define MEMSS_O_M0_MEM_CONFIG          0x0U   // M0 Memory Configuration Register
#define MEMSS_O_M0_MEM_CONFIG_LOCK     0x4U   // Temporary Lock for M0 Memory Configuration
                                              // Register
#define MEMSS_O_M0_MEM_CONFIG_COMMIT   0x8U   // Permament Lock for M0 Memory Configuration
                                              // Register

#define MEMSS_O_CPU1_ROM_CONFIG          0x0U    // CPU1 ROM Configuration Register
#define MEMSS_O_CPU1_ROM_CONFIG_LOCK     0x4U    // Temporary Lock for CPU1 ROM Memory
                                                 // Configuration Register
#define MEMSS_O_CPU1_ROM_CONFIG_COMMIT   0x8U    // Permament Lock for CPU1 ROM Memory
                                                 // Configuration Register
#define MEMSS_O_CPU2_ROM_CONFIG          0x10U   // CPU2 ROM Configuration Register
#define MEMSS_O_CPU2_ROM_CONFIG_LOCK     0x14U   // Temporary Lock for CPU2 ROM Memory
                                                 // Configuration Register
#define MEMSS_O_CPU2_ROM_CONFIG_COMMIT   0x18U   // Permament Lock for CPU2 ROM Memory
                                                 // Configuration Register
#define MEMSS_O_CPU3_ROM_CONFIG          0x20U   // CPU3 ROM Configuration Register
#define MEMSS_O_CPU3_ROM_CONFIG_LOCK     0x24U   // Temporary Lock for CPU3 ROM Memory
                                                 // Configuration Register
#define MEMSS_O_CPU3_ROM_CONFIG_COMMIT   0x28U   // Permament Lock for CPU3 ROM Memory
                                                 // Configuration Register

