TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_memss.h
#define MEMSS_O_MEM_DLB_CONFIG          0x0U     // Dataline buffer enable
#define MEMSS_O_MEM_DLB_CONFIG_LOCK     0x4U     // Temporary Lock for DLB Configuration Register
#define MEMSS_O_MEM_DLB_CONFIG_COMMIT   0x8U     // Permament Lock for DLB Configuration Register
#define MEMSS_O_PERI_MEM_TEST_LOCK      0x10U    // Peripheral Memory Test Lock Register
#define MEMSS_O_PERI_MEM_TEST_CONTROL   0x14U    // Peripheral Memory Test control Register
#define MEMSS_O_PARITY_TEST             0x1FCU   // Enabling the parity test feature

#define MEMSS_O_CPU1_ROM_PATCH_REG_LOCK     0x0U     // Temporary Lock for CPU1 ROM PATCH ADDR, ECC
                                                     // and DATA registers
#define MEMSS_O_CPU1_ROM_PATCH_REG_COMMIT   0x4U     // Permament  Lock for CPU1 ROM PATCH ADDR,
                                                     // ECC and DATA registers
#define MEMSS_O_CPU1_0_ADDR                 0x10U    // Address-0 of ROM to be patched
#define MEMSS_O_CPU1_0_ECC                  0x14U    // ECC bits for Address-0 of ROM
#define MEMSS_O_CPU1_0_DATA64_L             0x18U    // Data[31:0] for Address-0
#define MEMSS_O_CPU1_0_DATA64_H             0x1CU    // Data[63:32] for Address-0
#define MEMSS_O_CPU1_1_ADDR                 0x20U    // Address-1 of ROM to be patched
#define MEMSS_O_CPU1_1_ECC                  0x24U    // ECC bits for Address-1 of ROM
#define MEMSS_O_CPU1_1_DATA64_L             0x28U    // Data[31:0] for Address-1
#define MEMSS_O_CPU1_1_DATA64_H             0x2CU    // Data[63:32] for Address-1
#define MEMSS_O_CPU1_2_ADDR                 0x30U    // Address-2 of ROM to be patched
#define MEMSS_O_CPU1_2_ECC                  0x34U    // ECC bits for Address-2 of ROM
#define MEMSS_O_CPU1_2_DATA64_L             0x38U    // Data[31:0] for Address-2
#define MEMSS_O_CPU1_2_DATA64_H             0x3CU    // Data[63:32] for Address-2
#define MEMSS_O_CPU1_3_ADDR                 0x40U    // Address-3 of ROM to be patched
#define MEMSS_O_CPU1_3_ECC                  0x44U    // ECC bits for Address-3 of ROM
#define MEMSS_O_CPU1_3_DATA64_L             0x48U    // Data[31:0] for Address-3
#define MEMSS_O_CPU1_3_DATA64_H             0x4CU    // Data[63:32] for Address-3
#define MEMSS_O_CPU1_4_ADDR                 0x50U    // Address-4 of ROM to be patched
#define MEMSS_O_CPU1_4_ECC                  0x54U    // ECC bits for Address-4 of ROM
#define MEMSS_O_CPU1_4_DATA64_L             0x58U    // Data[31:0] for Address-4
#define MEMSS_O_CPU1_4_DATA64_H             0x5CU    // Data[63:32] for Address-4
#define MEMSS_O_CPU1_5_ADDR                 0x60U    // Address-5 of ROM to be patched
#define MEMSS_O_CPU1_5_ECC                  0x64U    // ECC bits for Address-5 of ROM
#define MEMSS_O_CPU1_5_DATA64_L             0x68U    // Data[31:0] for Address-5
#define MEMSS_O_CPU1_5_DATA64_H             0x6CU    // Data[63:32] for Address-5
#define MEMSS_O_CPU1_6_ADDR                 0x70U    // Address-6 of ROM to be patched
#define MEMSS_O_CPU1_6_ECC                  0x74U    // ECC bits for Address-6 of ROM
#define MEMSS_O_CPU1_6_DATA64_L             0x78U    // Data[31:0] for Address-6
#define MEMSS_O_CPU1_6_DATA64_H             0x7CU    // Data[63:32] for Address-6
#define MEMSS_O_CPU1_7_ADDR                 0x80U    // Address-7 of ROM to be patched
#define MEMSS_O_CPU1_7_ECC                  0x84U    // ECC bits for Address-7 of ROM
#define MEMSS_O_CPU1_7_DATA64_L             0x88U    // Data[31:0] for Address-7
#define MEMSS_O_CPU1_7_DATA64_H             0x8CU    // Data[63:32] for Address-7
#define MEMSS_O_CPU1_8_ADDR                 0x90U    // Address-8 of ROM to be patched
#define MEMSS_O_CPU1_8_ECC                  0x94U    // ECC bits for Address-8 of ROM
#define MEMSS_O_CPU1_8_DATA64_L             0x98U    // Data[31:0] for Address-8
#define MEMSS_O_CPU1_8_DATA64_H             0x9CU    // Data[63:32] for Address-8
#define MEMSS_O_CPU1_9_ADDR                 0xA0U    // Address-9 of ROM to be patched
#define MEMSS_O_CPU1_9_ECC                  0xA4U    // ECC bits for Address-9 of ROM
#define MEMSS_O_CPU1_9_DATA64_L             0xA8U    // Data[31:0] for Address-9
#define MEMSS_O_CPU1_9_DATA64_H             0xACU    // Data[63:32] for Address-9
#define MEMSS_O_CPU1_10_ADDR                0xB0U    // Address-10 of ROM to be patched
#define MEMSS_O_CPU1_10_ECC                 0xB4U    // ECC bits for Address-10 of ROM
#define MEMSS_O_CPU1_10_DATA64_L            0xB8U    // Data[31:0] for Address-10
#define MEMSS_O_CPU1_10_DATA64_H            0xBCU    // Data[63:32] for Address-10
#define MEMSS_O_CPU1_11_ADDR                0xC0U    // Address-11 of ROM to be patched
#define MEMSS_O_CPU1_11_ECC                 0xC4U    // ECC bits for Address-11 of ROM
#define MEMSS_O_CPU1_11_DATA64_L            0xC8U    // Data[31:0] for Address-11
#define MEMSS_O_CPU1_11_DATA64_H            0xCCU    // Data[63:32] for Address-11
#define MEMSS_O_CPU1_12_ADDR                0xD0U    // Address-12 of ROM to be patched
#define MEMSS_O_CPU1_12_ECC                 0xD4U    // ECC bits for Address-12 of ROM
#define MEMSS_O_CPU1_12_DATA64_L            0xD8U    // Data[31:0] for Address-12
#define MEMSS_O_CPU1_12_DATA64_H            0xDCU    // Data[63:32] for Address-12
#define MEMSS_O_CPU1_13_ADDR                0xE0U    // Address-13 of ROM to be patched
#define MEMSS_O_CPU1_13_ECC                 0xE4U    // ECC bits for Address-13 of ROM
#define MEMSS_O_CPU1_13_DATA64_L            0xE8U    // Data[31:0] for Address-13
#define MEMSS_O_CPU1_13_DATA64_H            0xECU    // Data[63:32] for Address-13
#define MEMSS_O_CPU1_14_ADDR                0xF0U    // Address-14 of ROM to be patched
#define MEMSS_O_CPU1_14_ECC                 0xF4U    // ECC bits for Address-14 of ROM
#define MEMSS_O_CPU1_14_DATA64_L            0xF8U    // Data[31:0] for Address-14
#define MEMSS_O_CPU1_14_DATA64_H            0xFCU    // Data[63:32] for Address-14
#define MEMSS_O_CPU1_15_ADDR                0x100U   // Address-15 of ROM to be patched
#define MEMSS_O_CPU1_15_ECC                 0x104U   // ECC bits for Address-15 of ROM
#define MEMSS_O_CPU1_15_DATA64_L            0x108U   // Data[31:0] for Address-15
#define MEMSS_O_CPU1_15_DATA64_H            0x10CU   // Data[63:32] for Address-15


//*************************************************************************************************
//
// The following are defines for the bit fields in the LPA0_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_LPA0_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_LPA0_MEM_CONFIG_TESTMODE_M   0x3U         // LPA0 Test Mode
#define MEMSS_LPA0_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_LPA0_MEM_CONFIG_INIT_STS     0x1000000U   // LPA0 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the LPA0_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_LPA0_MEM_CONFIG_LOCK_LPA0_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the LPA0_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_LPA0_MEM_CONFIG_COMMIT_LPA0_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the LPA1_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_LPA1_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_LPA1_MEM_CONFIG_TESTMODE_M   0x3U         // LPA1 Test Mode
#define MEMSS_LPA1_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_LPA1_MEM_CONFIG_INIT_STS     0x1000000U   // LPA1 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the LPA1_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_LPA1_MEM_CONFIG_LOCK_LPA1_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the LPA1_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_LPA1_MEM_CONFIG_COMMIT_LPA1_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA0_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_LDA0_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_LDA0_MEM_CONFIG_TESTMODE_M   0x3U         // LDA0 Test Mode
#define MEMSS_LDA0_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_LDA0_MEM_CONFIG_INIT_STS     0x1000000U   // LDA0 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA0_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_LDA0_MEM_CONFIG_LOCK_LDA0_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA0_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_LDA0_MEM_CONFIG_COMMIT_LDA0_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA1_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_LDA1_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_LDA1_MEM_CONFIG_TESTMODE_M   0x3U         // LDA1 Test Mode
#define MEMSS_LDA1_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_LDA1_MEM_CONFIG_INIT_STS     0x1000000U   // LDA1 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA1_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_LDA1_MEM_CONFIG_LOCK_LDA1_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA1_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_LDA1_MEM_CONFIG_COMMIT_LDA1_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA2_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_LDA2_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_LDA2_MEM_CONFIG_TESTMODE_M   0x3U         // LDA2 Test Mode
#define MEMSS_LDA2_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_LDA2_MEM_CONFIG_INIT_STS     0x1000000U   // LDA2 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA2_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_LDA2_MEM_CONFIG_LOCK_LDA2_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA2_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_LDA2_MEM_CONFIG_COMMIT_LDA2_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA3_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_LDA3_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_LDA3_MEM_CONFIG_TESTMODE_M   0x3U         // LDA3 Test Mode
#define MEMSS_LDA3_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_LDA3_MEM_CONFIG_INIT_STS     0x1000000U   // LDA3 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA3_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_LDA3_MEM_CONFIG_LOCK_LDA3_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA3_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_LDA3_MEM_CONFIG_COMMIT_LDA3_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA4_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_LDA4_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_LDA4_MEM_CONFIG_TESTMODE_M   0x3U         // LDA4 Test Mode
#define MEMSS_LDA4_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_LDA4_MEM_CONFIG_INIT_STS     0x1000000U   // LDA4 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA4_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_LDA4_MEM_CONFIG_LOCK_LDA4_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA4_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_LDA4_MEM_CONFIG_COMMIT_LDA4_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA5_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_LDA5_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_LDA5_MEM_CONFIG_TESTMODE_M   0x3U         // LDA5 Test Mode
#define MEMSS_LDA5_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_LDA5_MEM_CONFIG_INIT_STS     0x1000000U   // LDA5 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA5_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_LDA5_MEM_CONFIG_LOCK_LDA5_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA5_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_LDA5_MEM_CONFIG_COMMIT_LDA5_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA6_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_LDA6_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_LDA6_MEM_CONFIG_TESTMODE_M   0x3U         // LDA6 Test Mode
#define MEMSS_LDA6_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_LDA6_MEM_CONFIG_INIT_STS     0x1000000U   // LDA6 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA6_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_LDA6_MEM_CONFIG_LOCK_LDA6_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA6_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_LDA6_MEM_CONFIG_COMMIT_LDA6_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA7_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_LDA7_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_LDA7_MEM_CONFIG_TESTMODE_M   0x3U         // LDA7 Test Mode
#define MEMSS_LDA7_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_LDA7_MEM_CONFIG_INIT_STS     0x1000000U   // LDA7 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA7_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_LDA7_MEM_CONFIG_LOCK_LDA7_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the LDA7_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_LDA7_MEM_CONFIG_COMMIT_LDA7_MEM_CONFIG_LOCK   0x1U   // Permanent Commit


//*************************************************************************************************
//
// The following are defines for the bit fields in the CPA0_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CPA0_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CPA0_MEM_CONFIG_TESTMODE_M   0x3U         // LPA0 Test Mode
#define MEMSS_CPA0_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CPA0_MEM_CONFIG_INIT_STS     0x1000000U   // CPA0 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPA0_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CPA0_MEM_CONFIG_LOCK_CPA0_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPA0_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CPA0_MEM_CONFIG_COMMIT_CPA0_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPA1_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CPA1_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CPA1_MEM_CONFIG_TESTMODE_M   0x3U         // LPA1 Test Mode
#define MEMSS_CPA1_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CPA1_MEM_CONFIG_INIT_STS     0x1000000U   // CPA1 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPA1_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CPA1_MEM_CONFIG_LOCK_CPA1_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPA1_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CPA1_MEM_CONFIG_COMMIT_CPA1_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA0_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CDA0_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CDA0_MEM_CONFIG_TESTMODE_M   0x3U         // LDA0 Test Mode
#define MEMSS_CDA0_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CDA0_MEM_CONFIG_INIT_STS     0x1000000U   // CDA0 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA0_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CDA0_MEM_CONFIG_LOCK_CDA0_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA0_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CDA0_MEM_CONFIG_COMMIT_CDA0_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

