TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_memss.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA1_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CDA1_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CDA1_MEM_CONFIG_TESTMODE_M   0x3U         // LDA1 Test Mode
#define MEMSS_CDA1_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CDA1_MEM_CONFIG_INIT_STS     0x1000000U   // CDA1 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA1_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CDA1_MEM_CONFIG_LOCK_CDA1_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA1_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CDA1_MEM_CONFIG_COMMIT_CDA1_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA2_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CDA2_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CDA2_MEM_CONFIG_TESTMODE_M   0x3U         // LDA2 Test Mode
#define MEMSS_CDA2_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CDA2_MEM_CONFIG_INIT_STS     0x1000000U   // CDA2 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA2_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CDA2_MEM_CONFIG_LOCK_CDA2_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA2_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CDA2_MEM_CONFIG_COMMIT_CDA2_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA3_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CDA3_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CDA3_MEM_CONFIG_TESTMODE_M   0x3U         // LDA3 Test Mode
#define MEMSS_CDA3_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CDA3_MEM_CONFIG_INIT_STS     0x1000000U   // CDA3 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA3_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CDA3_MEM_CONFIG_LOCK_CDA3_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA3_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CDA3_MEM_CONFIG_COMMIT_CDA3_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA4_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CDA4_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CDA4_MEM_CONFIG_TESTMODE_M   0x3U         // LDA4 Test Mode
#define MEMSS_CDA4_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CDA4_MEM_CONFIG_INIT_STS     0x1000000U   // CDA4 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA4_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CDA4_MEM_CONFIG_LOCK_CDA4_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA4_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CDA4_MEM_CONFIG_COMMIT_CDA4_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA5_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CDA5_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CDA5_MEM_CONFIG_TESTMODE_M   0x3U         // LDA5 Test Mode
#define MEMSS_CDA5_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CDA5_MEM_CONFIG_INIT_STS     0x1000000U   // CDA5 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA5_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CDA5_MEM_CONFIG_LOCK_CDA5_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA5_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CDA5_MEM_CONFIG_COMMIT_CDA5_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA6_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CDA6_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CDA6_MEM_CONFIG_TESTMODE_M   0x3U         // LDA6 Test Mode
#define MEMSS_CDA6_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CDA6_MEM_CONFIG_INIT_STS     0x1000000U   // CDA6 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA6_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CDA6_MEM_CONFIG_LOCK_CDA6_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA6_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CDA6_MEM_CONFIG_COMMIT_CDA6_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA7_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CDA7_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CDA7_MEM_CONFIG_TESTMODE_M   0x3U         // LDA7 Test Mode
#define MEMSS_CDA7_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CDA7_MEM_CONFIG_INIT_STS     0x1000000U   // CDA7 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA7_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CDA7_MEM_CONFIG_LOCK_CDA7_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA7_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CDA7_MEM_CONFIG_COMMIT_CDA7_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA8_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CDA8_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CDA8_MEM_CONFIG_TESTMODE_M   0x3U         // LDA8 Test Mode
#define MEMSS_CDA8_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CDA8_MEM_CONFIG_INIT_STS     0x1000000U   // CDA8 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA8_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CDA8_MEM_CONFIG_LOCK_CDA8_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA8_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CDA8_MEM_CONFIG_COMMIT_CDA8_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA9_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CDA9_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CDA9_MEM_CONFIG_TESTMODE_M   0x3U         // LDA9 Test Mode
#define MEMSS_CDA9_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CDA9_MEM_CONFIG_INIT_STS     0x1000000U   // CDA9 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA9_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CDA9_MEM_CONFIG_LOCK_CDA9_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA9_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CDA9_MEM_CONFIG_COMMIT_CDA9_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA10_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CDA10_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CDA10_MEM_CONFIG_TESTMODE_M   0x3U         // LDA10 Test Mode
#define MEMSS_CDA10_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CDA10_MEM_CONFIG_INIT_STS     0x1000000U   // CDA10 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA10_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CDA10_MEM_CONFIG_LOCK_CDA10_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA10_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CDA10_MEM_CONFIG_COMMIT_CDA10_MEM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA11_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CDA11_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_CDA11_MEM_CONFIG_TESTMODE_M   0x3U         // LDA11 Test Mode
#define MEMSS_CDA11_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_CDA11_MEM_CONFIG_INIT_STS     0x1000000U   // CDA11 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA11_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CDA11_MEM_CONFIG_LOCK_CDA11_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CDA11_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CDA11_MEM_CONFIG_COMMIT_CDA11_MEM_CONFIG_LOCK   0x1U   // Permanent Commit


//*************************************************************************************************
//
// The following are defines for the bit fields in the M0_MEM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_M0_MEM_CONFIG_TESTMODE_S   0U
#define MEMSS_M0_MEM_CONFIG_TESTMODE_M   0x3U         // M0 Test Mode
#define MEMSS_M0_MEM_CONFIG_INIT         0x10000U     // Triggers memory Initilization
#define MEMSS_M0_MEM_CONFIG_INIT_STS     0x1000000U   // M0 INIT status

//*************************************************************************************************
//
// The following are defines for the bit fields in the M0_MEM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_M0_MEM_CONFIG_LOCK_M0_MEM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the M0_MEM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_M0_MEM_CONFIG_COMMIT_M0_MEM_CONFIG_LOCK   0x1U   // Permanent Commit


//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_ROM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CPU1_ROM_CONFIG_TESTMODE_S   0U
#define MEMSS_CPU1_ROM_CONFIG_TESTMODE_M   0x3U   // CPU1_ROM Test Mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_ROM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CPU1_ROM_CONFIG_LOCK_CPU1_ROM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_ROM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CPU1_ROM_CONFIG_COMMIT_CPU1_ROM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_ROM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CPU2_ROM_CONFIG_TESTMODE_S   0U
#define MEMSS_CPU2_ROM_CONFIG_TESTMODE_M   0x3U   // CPU1_ROM Test Mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_ROM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CPU2_ROM_CONFIG_LOCK_CPU2_ROM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_ROM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CPU2_ROM_CONFIG_COMMIT_CPU2_ROM_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU3_ROM_CONFIG register
//
//*************************************************************************************************
#define MEMSS_CPU3_ROM_CONFIG_TESTMODE_S   0U
#define MEMSS_CPU3_ROM_CONFIG_TESTMODE_M   0x3U   // CPU1_ROM Test Mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU3_ROM_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CPU3_ROM_CONFIG_LOCK_CPU3_ROM_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU3_ROM_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CPU3_ROM_CONFIG_COMMIT_CPU3_ROM_CONFIG_LOCK   0x1U   // Permanent Commit


//*************************************************************************************************
//
// The following are defines for the bit fields in the MEM_DLB_CONFIG register
//
//*************************************************************************************************
#define MEMSS_MEM_DLB_CONFIG_CPU1_DLB_EN         0x1U    // CPU1 Data line buffer Enable
#define MEMSS_MEM_DLB_CONFIG_CPU2_DLB_EN         0x2U    // CPU2 Data line buffer Enable
#define MEMSS_MEM_DLB_CONFIG_CPU3_DLB_EN         0x4U    // CPU3 Data line buffer Enable
#define MEMSS_MEM_DLB_CONFIG_SYNCBRIDGE_DLB_EN   0x40U   // Sync Bridge Dataline buffer Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the MEM_DLB_CONFIG_LOCK register
//
//*************************************************************************************************
#define MEMSS_MEM_DLB_CONFIG_LOCK_MEM_DLB_CONFIG   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the MEM_DLB_CONFIG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_MEM_DLB_CONFIG_COMMIT_MEM_DLB_CONFIG_LOCK   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PERI_MEM_TEST_LOCK register
//
//*************************************************************************************************
#define MEMSS_PERI_MEM_TEST_LOCK_PERI_MEM_TEST_CONTROL   0x1U   // PERI_MEM_TEST_CONTROL Lock bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PERI_MEM_TEST_CONTROL register
//
//*************************************************************************************************
#define MEMSS_PERI_MEM_TEST_CONTROL_ETHERCAT_MEM_FORCE_ERROR   0x20U   // Force Parity Error on
                                                                       // EtherCAT RAM

//*************************************************************************************************
//
// The following are defines for the bit fields in the PARITY_TEST register
//
//*************************************************************************************************
#define MEMSS_PARITY_TEST_TESTEN_S   0U
#define MEMSS_PARITY_TEST_TESTEN_M   0xFU   // Parity test enable


//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_ROM_PATCH_REG_LOCK register
//
//*************************************************************************************************
#define MEMSS_CPU1_ROM_PATCH_REG_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_ROM_PATCH_REG_COMMIT register
//
//*************************************************************************************************
#define MEMSS_CPU1_ROM_PATCH_REG_COMMIT_COMMIT   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_0_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_0_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_0_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_0_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_0_ECC_ECC_S   0U
#define MEMSS_CPU1_0_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_1_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_1_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_1_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

