TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_memss.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_1_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_1_ECC_ECC_S   0U
#define MEMSS_CPU1_1_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_2_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_2_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_2_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_2_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_2_ECC_ECC_S   0U
#define MEMSS_CPU1_2_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_3_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_3_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_3_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_3_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_3_ECC_ECC_S   0U
#define MEMSS_CPU1_3_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_4_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_4_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_4_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_4_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_4_ECC_ECC_S   0U
#define MEMSS_CPU1_4_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_5_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_5_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_5_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_5_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_5_ECC_ECC_S   0U
#define MEMSS_CPU1_5_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_6_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_6_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_6_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_6_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_6_ECC_ECC_S   0U
#define MEMSS_CPU1_6_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_7_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_7_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_7_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_7_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_7_ECC_ECC_S   0U
#define MEMSS_CPU1_7_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_8_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_8_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_8_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_8_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_8_ECC_ECC_S   0U
#define MEMSS_CPU1_8_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_9_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_9_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_9_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_9_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_9_ECC_ECC_S   0U
#define MEMSS_CPU1_9_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_10_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_10_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_10_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_10_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_10_ECC_ECC_S   0U
#define MEMSS_CPU1_10_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_11_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_11_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_11_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_11_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_11_ECC_ECC_S   0U
#define MEMSS_CPU1_11_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_12_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_12_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_12_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_12_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_12_ECC_ECC_S   0U
#define MEMSS_CPU1_12_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_13_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_13_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_13_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_13_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_13_ECC_ECC_S   0U
#define MEMSS_CPU1_13_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_14_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_14_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_14_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_14_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_14_ECC_ECC_S   0U
#define MEMSS_CPU1_14_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_15_ADDR register
//
//*************************************************************************************************
#define MEMSS_CPU1_15_ADDR_ADDR_64B_ALIGNED_S   3U
#define MEMSS_CPU1_15_ADDR_ADDR_64B_ALIGNED_M   0xFFFFFFF8U   // Address to be patched

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_15_ECC register
//
//*************************************************************************************************
#define MEMSS_CPU1_15_ECC_ECC_S   0U
#define MEMSS_CPU1_15_ECC_ECC_M   0xFFU   // ECC of 64 bits to be patched



#endif
